///
/// サーボモータを単純に駆動してみる
///
/****************************************************
 * マクロ部
 ****************************************************/
#include <SPI.h>
#include <SD.h>

/****************************************************
 * グローバル変数/配列 宣言部
 ****************************************************/
int chipSelect = 10;




/****************************************************
 * Arduino 要求関数部
 ****************************************************/
void setup() {
  Serial.begin(57600);
  while (!Serial) {
    ; //wait for serial port to connect.
  }

  Serial.println("Initializing SD card...");
  if (!SD.begin(chipSelect)) {
    Serial.println("Card failed, or not present");
    return;
  }
  Serial.println("card initialized.");
}

void loop() {

}

/****************************************************
 * 独自関数部
 ****************************************************/
